/* Mednafen - Multi-system Emulator
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA
 */

#include        "mednafen.h"


#ifdef _MSC_VER
#include "unixstuff.h"
#else
#include	<stdarg.h>
#include	<errno.h>
#include	<sys/types.h>
#include	<sys/stat.h>
#include	<unistd.h>
#endif

#include        <string.h>
#include	<trio/trio.h>

#include "drivers/main.h"

#include	"netplay.h"
#include	"netplay-driver.h"
#include	"general.h"
#include	"endian.h"
#include        "memory.h"

#include	"state.h"
#include	"movie.h"
#include        "video.h"
#include	"file.h"
#include	"wave.h"
#include	"cdrom/cdromif.h"
#include	"mempatcher.h"
#include	"compress/minilzo.h"
#include	"tests.h"
#include	"video/vblur.h"
#include    "settings-driver.h"
#include    "pce/pce.h"
#include <iostream>

void MMRecord_End(void);

 strcpy(oldmsg, TheMessage);

 va_list ap;
 va_start(ap, format);
 trio_vsnprintf(oldmsg, sizeof(TheMessage), format, ap);
 va_end(ap);

 int freelen = sizeof(TheMessage) - strlen(TheMessage);
 strncpy(TheMessage + strlen(TheMessage), oldmsg, freelen);
}

void MDFNException::AddPost(const char *format, ...)
{
 int freelen = sizeof(TheMessage) - strlen(TheMessage);

 if(freelen <= 0)
 {
  puts("ACKACKACK Exception erorrorololoz");
  return;
 }

 va_list ap;

 va_start(ap, format);
 trio_vsnprintf(TheMessage + strlen(TheMessage), freelen, format, ap);
 va_end(ap);
}


void MDFNI_SetPixelFormat(int rshift, int gshift, int bshift, int ashift)
{
 FSettings.rshift = rshift;
 FSettings.gshift = gshift;
 FSettings.bshift = bshift;
 FSettings.ashift = ashift;

 if(MDFNGameInfo)
  MDFNGameInfo->SetPixelFormat(rshift, gshift, bshift);
}


void MDFN_DoSimpleCommand(int cmd)
{
 MDFNGameInfo->DoSimpleCommand(cmd);
}

void MDFN_QSimpleCommand(int cmd)
{
 #ifdef NETWORK
 if(MDFNnetplay)
  MDFNNET_SendCommand(cmd, 0);
 else
 #endif
 {
  if(!MDFNMOV_IsPlaying())
  {
   MDFN_DoSimpleCommand(cmd);
   //MDFNMOV_AddCommand(cmd);
  }
 }
}

void MDFNI_Power(void)
{
 if(MDFNGameInfo)
  MDFN_QSimpleCommand(MDFNNPCMD_POWER);
}

void MDFNI_Reset(void)
{
 if(MDFNGameInfo)
  MDFN_QSimpleCommand(MDFNNPCMD_RESET);
}


void MDFNI_SetSoundVolume(uint32 volume)
{
 FSettings.SoundVolume=volume;
 if(MDFNGameInfo)
 {
  MDFNGameInfo->SetSoundVolume(volume);
 }
}

void MDFNI_Sound(int Rate)
{
 FSettings.SndRate=Rate;
 if(MDFNGameInfo)
 {
  MDFNGameInfo->Sound(Rate);
 }
}

void MDFNI_ToggleLayer(int which)
{
 if(MDFNGameInfo)
 {
  const char *goodies = MDFNGameInfo->LayerNames;
  int x = 0;
  while(x != which)
  {
   while(*goodies)
    goodies++;
   goodies++;
   if(!*goodies) return; // ack, this layer doesn't exist.
   x++;
  }
  if(MDFNGameInfo->ToggleLayer(which))
   MDFN_DispMessage((UTF8*)_("%s enabled."), _(goodies));
  else
   MDFN_DispMessage((UTF8*)_("%s disabled."), _(goodies));
 }
}

//initialization, not regular emulation
//however this sets up a pointer, which points to another pointer, which.....
//that eventually gets you to the emulated console

void MDFNI_SetInput(int port, const char *type, void *ptr, uint32 ptr_len_thingy)
{
 if(MDFNGameInfo)
 {
  assert(port < 16);

  PortDataCache[port] = ptr;
  PortDataLenCache[port] = ptr_len_thingy;

  if(PortDeviceCache[port])
  {
   free(PortDeviceCache[port]);
   PortDeviceCache[port] = NULL;
  }

  PortDeviceCache[port] = strdup(type);

  MDFNGameInfo->SetInput(port, type, ptr);
 }
}

int MDFNI_DiskInsert(int oride)
{
 if(MDFNGameInfo && MDFNGameInfo->DiskInsert)
  return(MDFNGameInfo->DiskInsert(oride));

 return(0);
}

int MDFNI_DiskEject(void)
{
 if(MDFNGameInfo && MDFNGameInfo->DiskEject)
  return(MDFNGameInfo->DiskEject());

 return(0);
}

int MDFNI_DiskSelect(void)
{
 if(MDFNGameInfo && MDFNGameInfo->DiskSelect)
  return(MDFNGameInfo->DiskSelect());

 return(0);
}

#ifdef _MSC_VER
#pragma pack(push,1)
#endif

typedef struct
{
 /* 0x00 */ uint8 magic[16];            // "Mednafen M Movie"
 /* 0x10 */ uint32 version;             // 0x00
 /* 0x14 */ uint16 video_compressor;    // 0x01 = MiniLZO
 /* 0x16 */ uint16 audio_compressor;    // 0x00 = Raw

 /* 0x18 */ uint32 nominal_width;       // Nominal width of video output(scale from individual frame's width to this)
 /* 0x1C */ uint32 nominal_height;      // Nominal height of video output(scale from individual frame's height to this)

 /* 0x20 */ uint32 min_width;           // Minimum video width
 /* 0x24 */ uint32 max_width;           // Maximum video width
 /* 0x28 */ uint32 min_height;          // Minimum video height
 /* 0x2C */ uint32 max_height;          // Maximum video height

 /* 0x30 */ uint64 video_frame_counter; // Total number of video/stream frames
 /* 0x38 */ uint64 audio_frame_counter; // Total number of audio frames(audio samples / sound channels)
 /* 0x40 */ uint64 frame_index_offset;  // Offset of the frame index chunk in the file
 /* 0x48 */ uint64 sound_rate;          // Sound rate(32.32 fixed point)
 /* 0x50 */ uint32 sound_channels;      // Number of sound channels(1 or 2)
 /* 0x54 */ uint32 max_aframes_per_vframe;	// Maximum number of audio frames per video/stream frame.
 /* 0x58 */ uint8 padding[0x100 - 0x58];
//} 

//__attribute__((__packed__)) MM_Main_Header;

#ifdef _MSC_VER
} MM_Main_Header;
#pragma pack(pop)
#else
} __attribute__((__packed__)) MM_Main_Header;
#endif

static FILE *output_fp = NULL;
static uint8 *pixel_buffer = NULL;
static uint32 compress_buffer_size;
static uint8 *compress_buffer = NULL;

// Filled out partially and written when movie playback starts, completed and rewritten when movie playback ends.
static MM_Main_Header main_header;

static uint64 video_frame_counter;
static uint64 audio_frame_counter;
static uint32 min_width, max_width, min_height, max_height;
static uint32 max_aframes_per_vframe;

static uint64 LastFrameOffset;
static uint64 LastFrameTime;

static std::vector<uint32> FrameRelativeIndex;
static std::vector<uint32> FrameRelativeTime;
/*
int WriteMovie(void) {

 output_fp = fopen("movietest.txt", "wb");
 if(!output_fp)
 {
  puts("fuck");
 // MDFN_PrintError("%m\n", errno);
  return(0);
 }

